cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack' # grep
brew 'ansible'
brew 'asdf'
brew 'awscli'
brew 'bat' # cat
brew 'coreutils'
brew 'fd' # find
brew 'fzf' # fuzzy finder
brew 'gpg'
brew 'gpg2'
brew 'hub' # https://hub.github.com/
brew 'imagemagick'
brew 'jq' # json query
brew 'libgit2'
brew 'ngrep'
brew 'openssl'
brew 'readline'
brew 'switchaudio-osx'
brew 'terraform'
brew 'watchman'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'atom'
cask 'authy'
cask 'docker'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'macmediakeyforwarder'
cask 'postman'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoomus'
