cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack' # grep
brew 'asdf' # https://github.com/asdf-vm/asdf
brew 'bat' # cat
brew 'coreutils' # https://apple.stackexchange.com/questions/69223/how-to-replace-mac-os-x-utilities-with-gnu-core-utilities
brew 'fd' # find
brew 'fzf' # fuzzy finder
brew 'jq' # json query
brew 'openssl'
brew 'readline'
brew 'switchaudio-osx'
brew 'wget'
brew 'zsh-syntax-highlighting'
brew 'zsh'

cask '1password'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'rectangle'
cask 'spotify'
cask 'visual-studio-code'
cask 'whatsapp'
